// --------------------------------------------------------------------------
// 📌 [미션]
// --------------------------------------------------------------------------
// - 문장 안에 포함된 숫자(정수)의 갯수를 구하시오.
// - Ramda 라이브러리를 사용해 함수 구성(function composition)을 활용하세요.
// - 참고: PechaKucha (https://en.wikipedia.org/wiki/PechaKucha)
// --------------------------------------------------------------------------


const sentense = '페차쿠차(PechaKucha)는 발표자가 각각 20초 동안 해설하는 20개의 슬라이드를 보여주는 스토리텔링 형식입니다. (총 6분 40초)';

// 함수 구성을 사용해 문장 안에 포함된 숫자(정수)의 갯수를 구하시오. (Ramda 라이브러리 활용)